// 07 - React Native

React Native — это фреймворк для разработки кроссплатформенных приложений для iOS и Android

// 12 
репо https://github.com/romabelka/adv-react-07-08

// 22 -  создали обычную форму авторизации

// 25 - Redux-form
https://redux-form.com/8.2.2/
распространен широко, но уже не является однозначным лидером
больше под Redux

React Final Form
https://github.com/final-form/react-final-form
заточен под Реакт

Formik
https://github.com/jaredpalmer/formik
тоже хорош, с доками

Будем пользовать здесь Redux - form

// 30 Формы

В 'redux/reducer.js' связь с Редаксом


Sign -in


    // 42 Sign-Up

    // 55 
    В бибке 'ant-design' есть своя бибка форм


// 56 Firebase

// 59
Redux Ducks позволяет разбивать код на сучности

Он позволяет хранить в одном месте данные по изолированным
частям приложения

Хорошо на него ложится крупнокомпонентная задача - чат, напр

Плохо подходит, к примеру, аутентификация - данные о которой
нужны во всех частях приложения.Т е глобальные вещи



